def Task6(Q, x, y, m):
    return (f"""Хімічне підприємство отримало заказ на 800 {Q} млн. грн.
Прибуток при заказі буде складати 8% {x}. Керівництво планує знизити 
собівартість робіт на 5% {y}. Загально виробничі витрати складають 14,5 {m}%.
Визначити: 1) величину прибутку підприємства; 2) економію коштів від
зниження собівартості проекту; 3) планову собівартість. """)


def Task7(ClP1, ClP2, B1, B2):
    return (f"""
Визначити: зміну рентабельності товарної продукції; 
заплановані витрати на 1 грн. товарної продукції. Порівняти ефективність
роботи двох підприємств. Представлені наступні дані: 
1) перше підприємство:
Чистий прибуток - {ClP1} млн. грн.;
Витрати на виробництво і реалізацію продукції - {B1} млн. грн.;
2) друге підприємство:
Чистий прибуток - {ClP2} млн. грн.;
Витрати виробництво і реалізацію продукції - {B2} млн. грн. 
""")


def Task8(M1, M2, M3, N1, N2, N3, Rn):
    return (f"""
Визначити прибуток та рентабельність виробу на кожному з
трьох підприємств, які випускають миючі хімікати однакової моделі, якщо
повна собівартість виробу на підприємствах: М1 = {M1} грн./шт.., М2 = {M2}грн./шт..,
М3 = {M3} грн./шт.., а річний обсяг виробництва миючих складає: N1 = {N1} шт/рік; 
N2 = {N2} шт/рік; N3 = {N3} прим/рік. Відомо, що нормативна рентабельність Рн = {Rn}%.
""")


def Calculate8(M1, M2, M3, N1, N2, N3, Rn):
    ss = (M1 * N1 + M2 * N2 + M3 * N3) / (N1 + N2 + N3)
    c = ss * (1+Rn/100)
    return (f"""
1) Визначимо середньогалузеву собівартість
Сс = ({M1} * {N1} + {M2} * {N2} + {M3} * {N3}) / ({N1} + {N2} + {N3}) = {ss} грн.
2) Визначимо оптову ціну (Ц)
Ц = {ss}*(1+{Rn}/100) = {c} грн.
3) Визначимо прибуток на один миючий для кожного підприємства за формулою П = Ц – С
П1={c}-{M1} = {str(c-M1)[:7]} грн
П2={c}-{M2} = {str(c-M2)[:7]} грн
П3={c}-{M3} = {str(c-M3)[:7]} грн
4) Визначимо рентабельність миючого, для кожного з підприємств за формулою Р = П/С • 100%: 
Р1={str(c-M1)[:5]}/{M1}*100% = {str((c-M1)/M1*100)[:5]}%
Р2={str(c-M2)[:5]}/{M2}*100% = {str((c-M2)/M2*100)[:5]}%
Р3={str(c-M3)[:5]}/{M3}*100% = {str((c-M3)/M3*100)[:5]}%
""")


def Calculate7(ClP1, ClP2, B1, B2):
    r1 = ClP1 / B1 * 100
    r2 = ClP2 / B2 * 100

    ans = ['???', "???", "???", "???"]
    if ClP1 > ClP2:
        ans[0] = 'першого'
        if r1 > r2:
            ans[1] = 'білша'
            ans[2] = 'більш'
        else:
            ans[1] = 'менша'
            ans[2] = 'менш'
        ans[3] = "другим"
    else:
        ans[0] = 'другого'
        if r1 < r2:
            ans[1] = 'більша'
            ans[2] = 'більш'
        else:
            ans[1] = 'менша'
            ans[2] = 'менш'
        ans[3] = "першим"

    return f"""
1) Рентабельність першого підприємства визначається за формулою
R1 = {ClP1}/{B1}*100 = {str(r1)[:5]}%
2) Рентабельність другого підприємства визначається за формулою
R2 = {ClP2}/{B2}*100 = {str(r1)[:5]}%

Прибуток {ans[0]} підприємства більший,
рентабельність його {ans[1]}, отже, кожна вкладена гривня використовується
{ans[2]} ефективно у порівнянні з {ans[3]} підприємством.
"""


def Calculate6(Q, x, y, m):
    all_expenses = Q * m / 100
    sn = Q + all_expenses
    p = sn + x / 100
    e = sn * y / 100
    sp = sn - e
    return f"""
1)Визначимо суму загальновиробничих витрат:
ЗВ = {Q} * {m/100} = {all_expenses} (млн.грн)
2)Кошторисна (нормативна) собівартість:
Сн = ПВ + ЗВ = {Q} + {all_expenses} = {sn} (млн.грн)
3)Визначимо величину прибутку:
П = {sn} * {x/100} = {p} (млн.грн)    
4)Визначимо суму планового зниження, що і буде економією коштів від
зниження собівартості БМР:
Е = {sn} * {y/100} = {e} (млн.грн)
5)Визначаємо планову собівартість:
Сп = Cc - Е = {sn} - {e} = {sp} (млн.грн)
"""
